run/randomProcessUnCorr/rectangularCavityPar/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{

    frontAndBack
    {
        type            empty;
    }

    inlet
    {
        type        randomProcessUnCorr;
        value       uniform (0 0 0);
        U0          uniform (1 0 0);
        gustDir     uniform (0 1 0);
        scaleFac    1.0;

        circFreq
        List<scalar>
        100
        (0.         0.06283185 0.12566371 0.18849556 0.25132741 0.31415927 0.37699112
        0.43982297 0.50265482 0.56548668 0.62831853 0.69115038 0.75398224 0.81681409
        0.87964594 0.9424778  1.00530965 1.0681415  1.13097336 1.19380521 1.25663706
        1.31946891 1.38230077 1.44513262 1.50796447 1.57079633 1.63362818 1.69646003
        1.75929189 1.82212374 1.88495559 1.94778745 2.0106193  2.07345115 2.136283
        2.19911486 2.26194671 2.32477856 2.38761042 2.45044227 2.51327412 2.57610598
        2.63893783 2.70176968 2.76460154 2.82743339 2.89026524 2.95309709 3.01592895
        3.0787608  3.14159265 3.20442451 3.26725636 3.33008821 3.39292007 3.45575192
        3.51858377 3.58141563 3.64424748 3.70707933 3.76991118 3.83274304 3.89557489
        3.95840674 4.0212386  4.08407045 4.1469023  4.20973416 4.27256601 4.33539786
        4.39822972 4.46106157 4.52389342 4.58672527 4.64955713 4.71238898 4.77522083
        4.83805269 4.90088454 4.96371639 5.02654825 5.0893801  5.15221195 5.2150438
        5.27787566 5.34070751 5.40353936 5.46637122 5.52920307 5.59203492 5.65486678
        5.71769863 5.78053048 5.84336234 5.90619419 5.96902604 6.03185789 6.09468975
        6.1575216  6.22035345);

        psd
        List<scalar>
        100
        (1.40117770e-03 3.59629414e-03 8.35846363e-03 1.75916661e-02 3.35271591e-02
        5.78623144e-02 9.04282468e-02 1.27973983e-01 1.64001766e-01 1.90320087e-01
        2.00000000e-01 1.90320087e-01 1.64001766e-01 1.27973983e-01 9.04282468e-02
        5.78623144e-02 3.35271591e-02 1.75916661e-02 8.35846363e-03 3.59629414e-03
        1.40117770e-03 4.94356779e-04 1.57941782e-04 4.56943853e-05 1.19712061e-05
        2.84002553e-06 6.10120816e-07 1.18691250e-07 2.09088830e-08 3.33543303e-09
        4.81817845e-10 6.30264436e-11 7.46572497e-12 8.00811750e-13 7.77854110e-14
        6.84187490e-15 5.44955916e-16 3.93058217e-17 2.56721151e-18 1.51836326e-19
        8.13203191e-21 3.94444753e-22 1.86987162e-23 3.53308832e-23 7.88815084e-22
        1.62640614e-20 3.03672652e-19 5.13442302e-18 7.86116433e-17 1.08991183e-15
        1.36837498e-14 1.55570822e-13 1.60162350e-12 1.49314499e-11 1.26052887e-10
        9.63635690e-10 6.67086605e-09 4.18177660e-08 2.37382501e-07 1.22024163e-06
        5.68005105e-06 2.39424123e-05 9.13887707e-05 3.15883565e-04 9.88713557e-04
        2.80235540e-03 7.19258827e-03 1.67169273e-02 3.51833323e-02 6.70543182e-02
        1.15724629e-01 1.80856494e-01 2.55947965e-01 3.28003532e-01 3.80640174e-01
        4.00000000e-01 3.80640174e-01 3.28003532e-01 2.55947965e-01 1.80856494e-01
        1.15724629e-01 6.70543182e-02 3.51833323e-02 1.67169273e-02 7.19258827e-03
        2.80235540e-03 9.88713557e-04 3.15883565e-04 9.13887707e-05 2.39424123e-05
        5.68005105e-06 1.22024163e-06 2.37382501e-07 4.18177660e-08 6.67086605e-09
        9.63635690e-10 1.26052887e-10 1.49314499e-11 1.60162350e-12 1.55570822e-13);
    }


    outlet
    {
        type            zeroGradient;
    }

    topAndBottom
    {
        type            slip;
    }

    defaultFaces
    {
        type            empty;
    }

}

// ************************************************************************* //
